In [1]:
# Pandas Series
# Series is a one dimensional array capable of holding data type. The axis labels are Collectively called as Index

In [2]:
# Creating Series

In [15]:
import numpy as np
import pandas as pd

In [6]:
labels = ['a', 'b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {1:10, 2:20, 3:30}

In [8]:
pd.Series(my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(d)

1    10
2    20
3    30
dtype: int64

In [11]:
# Combining Series is DataFrame 
# Creating a DataFrame 
data = {
    'Name': ['John','Anna', 'Peter', 'Linda'],
    'Age': [28,34,29,42],
    'City': ['New York', 'Paris', 'Berlin', 'London'], 
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [12]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [18]:
data_list = [
    ['John',28,'New York', 65000],
    ['Anna',34,'Paris',70000],
    ['Peter', 29, 'Berlin', 62000], 
    ['Linda', 42,'London', 85000]
    ]
df2 = pd.DataFrame(data_list)
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns=columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [19]:
df2['City']

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [20]:
df2[['Name','City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [21]:
# Creating a new Column
df2['Designation'] = ['Doctor', 'Engineer', 'Doctor', 'Engineer']

In [22]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000    Engineer

In [23]:
# Removing Column
df2.drop('Designation', axis=1)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [24]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000    Engineer

In [25]:
df2.drop('Designation', axis=1, inplace=True)

In [26]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [27]:
df2.drop(['Age', 'City'], axis=1)

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000
3  Linda   85000

In [28]:
df2.drop(0, axis=0) # Axis value is Default to true

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [29]:
# Selecting a row
df2.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [30]:
df.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

In [31]:
# Selecting a Subset of DataFrame
df.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [32]:
df.loc[[2,3]][['Name','Age']]

    Name  Age
2  Peter   29
3  Linda   42

In [33]:
# Conditional Selection
df2[df2['Age']>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [34]:
df2[df2['Age']>30 & df2['city'] == 'Paris']

KeyError: 'city'